benchmarks/rpom_bench_catalog_high_load.yml
config:
  target: "http://127.0.0.1:8000"
  http:
    tls:
      rejectUnauthorized: false
  phases:
  - duration: 60
    arrivalRate: 50
  - duration: 120
    arrivalRate: 50
    rampTo: 100
  - duration: 600
    arrivalRate: 100
  - duration: 300
    arrivalRate: 100
    rampTo: 200
  - duration: 300
    arrivalRate: 200
    rampTo: 500
  - duration: 600
    arrivalRate: 500
  environments:
    production:
      target: "http://35.204.41.173:8080"
scenarios:
- flow:
  - get:
      url: "/specifications"